import { removeEmojis } from '../emojiUtils';

describe('emojiUtils - removeEmojis', () => {
    describe('ZWJ sequences (complex emojis)', () => {
        it('should remove all comprehensive emoji sequences', () => {
            const input = 'before ✅❌🚫❓😶🙋‍♂️🤓🛠️⚙️🏁🫥📝😀😁😘☺️🤨🙄😯😛😔😲😤😩🥵🥴🤕🥸🫨🫣👺🤖😼🙉🦁🐷🐻‍❄️🫎🐾🐩🐎🐃🐪🦡🐇🐍🐬🐡🐚🦅🪿🪿🪶🦇🪱🐞🧞‍♂️🗣️🦴🫀⛷️👵👩‍🦱👩‍🦳👸👲🎅🕵️‍♂️👷‍♀️👩‍🎓👩‍⚖️👩‍⚖️👩‍🍳👩‍🏭👩‍🔬👩‍🎤👩‍✈️👩‍🚒👰👨‍🍼🦸‍♂️🧙‍♂️🧛‍♂️🧝‍♂️🙎‍♂️🙆‍♂️💁‍♂️🙇‍♂️🤷‍♂️💇‍♂️🤹‍♂️👨‍🦽‍➡️👨‍🦼‍➡️👨‍🦯‍➡️🧎‍♂️‍➡️🚶‍♂️‍➡️🏃‍♂️🕺🧘🏌️‍♀️🚣‍♀️🤽‍♀️⛹️‍♀️🚴‍♀️🤸‍♀️🦶👉🤞🫴😊🌞🎉⭐❤️👨‍⚕️👩‍⚕️👮‍♂️👮‍♀️👨‍🚒👩‍🚒👨‍✈️👩‍✈️👨‍👩‍👧‍👦👨‍👨‍👧👩‍👩‍👦‍👦👩‍❤️‍👨👨‍❤️‍👨👩‍❤️‍👩👨‍❤️‍💋‍👨👩‍❤️‍💋‍👩🚶‍♀️‍➡️🏃‍♀️‍➡️👋👋🏻👋🏼👋🏽👋🏾👋🏿👍👍🏻👍🏼👍🏽👍🏾👍🏿🧑🧑🏻🧑🏼🧑🏽🧑🏾🧑🏿🤝🫱🏻‍🫲🏿🫱🏽‍🫲🏾🧑🏻‍🤝‍🧑🏿👫🏼👭🏾🇺🇸🇬🇧🇯🇵🇩🇪🇫🇷🇨🇦🇮🇹🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁳󠁣󠁴󠁿🏴󠁧󠁢󠁷󠁬󠁳󠁿⚠️#️⃣*️⃣0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🐶🐱🐭🐹🐰🦊🐻🐼🐨🐯🏠🚗⚽🎸🌻🌈📧📞💻⌚🫠🫡🫢🫤🫰🫵🫶✍️✍🏻✍🏼✍🏽✍🏾✍🏿🎅🎅🏻🎅🏼🎅🏽🎅🏾🎅🏿©®™ℹ️🌐💰after';
            const expected = 'before after';
            
            expect(removeEmojis(input)).toBe(expected);
        });

        it('should not remove numbers in emoji sequences', () => {
            const input = 'before 222✅❌🚫❓😶🙋‍♂️🤓🛠️⚙️🏁🫥📝😀😁😘☺️🤨🙄 12 😛😔😲😤😩2🥵🥴🤕🥸 12344 🫨🫣👺🤖😼🙉🦁🐷🐻‍❄️🫎🐾🐩🐎🐃🐪🦡🐇🐍🐬🐡🐚🦅🪿🪿🪶🦇🪱🐞🧞‍♂️🗣️🦴🫀⛷️👵👩‍🦱👩‍🦳👸 33 👲🎅🕵️‍♂️👷‍♀️👩‍🎓👩‍⚖️👩‍⚖️👩‍🍳👩‍🏭👩‍🔬👩‍🎤👩‍✈️111👩‍🚒👰👨‍🍼🦸‍♂️🧙‍♂️🧛‍♂️🧝‍♂️🙎‍♂️🙆‍♂️💁‍♂️🙇‍♂️🤷‍♂️💇‍♂️🤹‍♂️👨‍🦽‍➡️👨‍🦼‍➡️👨‍🦯‍➡️🧎‍♂️‍➡️🚶‍♂️‍➡️🏃‍♂️🕺🧘🏌️‍♀️🚣‍♀️🤽‍♀️⛹️‍♀️🚴‍♀️🤸‍♀️🦶👉🤞🫴😊🌞🎉⭐❤️👨‍⚕️👩‍⚕️👮‍♂️👮‍♀️👨‍🚒👩‍🚒👨‍✈️👩‍✈️👨‍👩‍👧‍👦👨‍👨‍👧👩‍👩‍👦‍👦👩‍❤️‍👨👨‍❤️‍👨👩‍❤️‍👩👨‍❤️‍💋‍👨👩‍❤️‍💋‍👩🚶‍♀️‍➡️🏃‍♀️‍➡️👋👋🏻👋🏼👋🏽👋🏾👋🏿👍👍🏻👍🏼👍🏽👍🏾👍🏿🧑🧑🏻🧑🏼🧑🏽🧑🏾🧑🏿🤝🫱🏻‍🫲🏿🫱🏽‍🫲🏾🧑🏻‍🤝‍🧑🏿👫🏼👭🏾🇺🇸🇬🇧🇯🇵🇩🇪🇫🇷🇨🇦🇮🇹🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁳󠁣󠁴󠁿🏴󠁧󠁢󠁷󠁬󠁳󠁿⚠️#️⃣*️⃣0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🐶🐱🐭🐹🐰🦊🐻🐼🐨🐯🏠🚗⚽🎸🌻🌈📧📞💻⌚🫠🫡🫢🫤🫰🫵🫶✍️✍🏻✍🏼✍🏽✍🏾✍🏿🎅🎅🏻🎅🏼🎅🏽🎅🏾🎅🏿©®™ℹ️🌐💰after';
            const expected = 'before 222 12 2 12344  33 111after';
            
            expect(removeEmojis(input)).toBe(expected);
        });

        it('should not remove numbers when only numbers present', () => {
            const input = '23123';
            const expected = '23123';
            
            expect(removeEmojis(input)).toBe(expected);
        });
    });
});
